yohanes-erwin/deeplearningedge/nn_nand_gate/stm32f446_hal_nand_performance/Middlewares/ST/Application/SystemPerformance/Src/aiSystemPerformance.c
    printf("STM32 Runtime configuration...\r\n");

    printf(" Device       : DevID:0x%08x (%s) RevID:0x%08x\r\n",
            (int)HAL_GetDEVID(),
            devIdToStr(HAL_GetDEVID()),
            (int)HAL_GetREVID()
    );

    printf(" Core Arch.   : M%d - %s %s\r\n",
            __CORTEX_M,
#if (__FPU_PRESENT == 1)
            "FPU PRESENT",
            __FPU_USED ? "and used" : "and not used!"
#else
            "!FPU NOT PRESENT",
            ""
#endif
    );

    printf(" HAL version  : 0x%08x\r\n", (int)HAL_GetHalVersion());

    val = systemCoreClock()/1000000;

#if !defined(STM32H7)
    printf(" system clock : %u MHz\r\n", (int)val);
#else
    printf(" SYSCLK clock : %u MHz\r\n", (int)val);
    printf(" HCLK clock   : %u MHz\r\n", (int)HAL_RCC_GetHCLKFreq()/1000000);    
#endif

#if defined(STM32F7) || defined(STM32H7)
    val = SCB->CCR;
#if !defined(STM32H7)
    printf(" FLASH conf.  : ACR=0x%08x - Prefetch=%s ART=%s latency=%d\r\n",
            (int)acr,
            bitToStr((acr & FLASH_ACR_PRFTEN_Msk) >> FLASH_ACR_PRFTEN_Pos),
            bitToStr((acr & FLASH_ACR_ARTEN_Msk) >> FLASH_ACR_ARTEN_Pos),
            (int)((acr & FLASH_ACR_LATENCY_Msk) >> FLASH_ACR_LATENCY_Pos));
#else
    printf(" FLASH conf.  : ACR=0x%08x - latency=%d\r\n",
            (int)acr,
            (int)((acr & FLASH_ACR_LATENCY_Msk) >> FLASH_ACR_LATENCY_Pos));
#endif
    printf(" CACHE conf.  : $I/$D=(%s,%s)\r\n",
            bitToStr(val & SCB_CCR_IC_Msk),
            bitToStr(val & SCB_CCR_DC_Msk));
#else
#if !defined(STM32F3)
    printf(" FLASH conf.  : ACR=0x%08x - Prefetch=%s $I/$D=(%s,%s) latency=%d\r\n",
            (int)acr,
            bitToStr((acr & FLASH_ACR_PRFTEN_Msk) >> FLASH_ACR_PRFTEN_Pos),
            bitToStr((acr & FLASH_ACR_ICEN_Msk) >> FLASH_ACR_ICEN_Pos),
            bitToStr((acr & FLASH_ACR_DCEN_Msk) >> FLASH_ACR_DCEN_Pos),
            (int)((acr & FLASH_ACR_LATENCY_Msk) >> FLASH_ACR_LATENCY_Pos));
#endif
#endif
}

__STATIC_INLINE uint32_t disableInts(void)
{
    uint32_t state;

    state = __get_PRIMASK();
    __disable_irq();

    return state;
}

__STATIC_INLINE void restoreInts(uint32_t state)
{
   __set_PRIMASK(state);
}


/* -----------------------------------------------------------------------------
 * low-level I/O functions
 * -----------------------------------------------------------------------------
 */

static struct ia_malloc {
    uint32_t cfg;
    uint32_t alloc;
    uint32_t free;
    uint32_t alloc_req;
    uint32_t free_req;
} ia_malloc;

#define MAGIC_MALLOC_NUMBER 0xefdcba98


static int ioGetUint8(uint8_t *buff, int count, uint32_t timeout)
{
    HAL_StatusTypeDef status;

    if ((!buff) || (count <= 0))
        return -1;

    status = HAL_UART_Receive(&UartHandle, (uint8_t *)buff, count,
            timeout);

    if (status == HAL_TIMEOUT)
        return -1;

    return (status == HAL_OK ? count : 0);
}


#if defined(__GNUC__)

int _write(int fd, const void *buff, int count);

int _write(int fd, const void *buff, int count)
{
    HAL_StatusTypeDef status;

    if ((count < 0) && (fd != STDOUT_FILENO) && (fd != STDERR_FILENO)) {
        errno = EBADF;
        return -1;
    }

    status = HAL_UART_Transmit(&UartHandle, (uint8_t *)buff, count,
            HAL_MAX_DELAY);

    return (status == HAL_OK ? count : 0);
}

void* __real_malloc(size_t bytes);
void __real_free(void *ptr);

void* __wrap_malloc(size_t bytes)
{
    uint8_t *ptr;

    ia_malloc.cfg |= 1 << 1;

    /* ensure alignment for magic number */
    bytes = (bytes + 3) & ~3;

    /* add 2x32-bit for size and magic  number */
    ptr = (uint8_t*)__real_malloc(bytes + 8);

    /* remember size */
    if (ptr) {
        *((uint32_t*)ptr) = bytes;
        *((uint32_t*)(ptr + 4 + bytes)) = MAGIC_MALLOC_NUMBER;
    }

    if ((ptr) && (ia_malloc.cfg & 1UL)) {
        ia_malloc.alloc_req++;
        ia_malloc.alloc += bytes;
    }
    return ptr?(ptr + 4):NULL;
}

void __wrap_free(void *ptr)
{
    uint8_t* p;
    uint32_t bytes;

    ia_malloc.cfg |= 1 << 2;

    if (!ptr)
        return;

    p = (uint8_t*)ptr - 4;
    bytes = *((uint32_t*)p);

    if (*((uint32_t*)(p + 4 + bytes)) == MAGIC_MALLOC_NUMBER) {
        *((uint32_t*)(p + 4 + bytes)) = 0;
    }

    if (ia_malloc.cfg & 1UL) {
        ia_malloc.free_req++;
        ia_malloc.free += bytes;
    }
    __real_free(p);
}


#elif defined (__ICCARM__)

__ATTRIBUTES  size_t __write(int handle, const unsigned char *buffer,
                             size_t size);

__ATTRIBUTES  size_t __write(int handle, const unsigned char *buffer,
                             size_t size)
{
    HAL_StatusTypeDef status;

    /*
     * This means that we should flush internal buffers.  Since we
     * don't we just return.  (Remember, "handle" == -1 means that all
     * handles should be flushed.)
     */
    if (buffer == 0)
      return 0;

    /* This template only writes to "standard out" and "standard err",
     * for all other file handles it returns failure.
     */
    if ((handle != _LLIO_STDOUT) && (handle != _LLIO_STDERR))
        return _LLIO_ERROR;

    status = HAL_UART_Transmit(&UartHandle, (uint8_t *)buffer, size,
            HAL_MAX_DELAY);

    return (status == HAL_OK ? size : _LLIO_ERROR);
}

#if _APP_HEAP_MONITOR_ == 1
#undef _APP_HEAP_MONITOR_
#define _APP_HEAP_MONITOR_ 0
#warning HEAP monitor is not YET supported
#endif

#elif defined (__CC_ARM)

int fputc(int ch, FILE *f)
{
      HAL_UART_Transmit(&UartHandle, (uint8_t *)&ch, 1,
            HAL_MAX_DELAY);
    return ch;
}

#if _APP_STACK_MONITOR_ == 1
#undef _APP_STACK_MONITOR_
#define _APP_STACK_MONITOR_ 0
#warning STACK monitor is not YET supported
#endif

#if _APP_HEAP_MONITOR_ == 1
#undef _APP_HEAP_MONITOR_
#define _APP_HEAP_MONITOR_ 0
#warning HEAP monitor is not YET supported
#endif

#else
#error ARM MCU tool-chain is not supported.
#endif


/* -----------------------------------------------------------------------------
 * AI-related functions
 * -----------------------------------------------------------------------------
 */

struct network_exec_ctx {
    ai_handle handle;
    ai_network_report report;
} net_ctx[AI_MNETWORK_NUMBER] = {0};

#define AI_BUFFER_NULL(ptr_)  \
  AI_BUFFER_OBJ_INIT( \
    AI_BUFFER_FORMAT_NONE|AI_BUFFER_FMT_FLAG_CONST, \
    0, 0, 0, 0, \
    AI_HANDLE_PTR(ptr_))

AI_ALIGNED(4)
static ai_u8 activations[AI_MNETWORK_DATA_ACTIVATIONS_SIZE];

AI_ALIGNED(4)
static ai_i8 in_data[AI_MNETWORK_IN_1_SIZE_BYTES];

AI_ALIGNED(4)
static ai_i8 out_data[AI_MNETWORK_OUT_1_SIZE_BYTES];

