yohanes-erwin/deeplearningedge/nn_nand_gate/stm32f446_hal_nand_performance/Middlewares/ST/Application/SystemPerformance/Src/aiSystemPerformance.c
__STATIC_INLINE void aiLogErr(const ai_error err, const char *fct)
{
    if (fct)
        printf("E: AI error (%s) - type=%d code=%d\r\n", fct,
                err.type, err.code);
    else
        printf("E: AI error - type=%d code=%d\r\n", err.type, err.code);
}

__STATIC_INLINE void aiPrintLayoutBuffer(const char *msg, int idx,
        const ai_buffer* buffer)
{
    uint32_t type_id = AI_BUFFER_FMT_GET_TYPE(buffer->format);
    printf("%s [%d]          : shape(HWC):(%d,%d,%ld) format=",
            msg, idx, buffer->height, buffer->width, buffer->channels);
    if (type_id == AI_BUFFER_FMT_TYPE_Q)
        printf("Q%d.%d (%dbits, %s)",
                (int)AI_BUFFER_FMT_GET_BITS(buffer->format)
                - ((int)AI_BUFFER_FMT_GET_FBITS(buffer->format) +
                   (int)AI_BUFFER_FMT_GET_SIGN(buffer->format)),
                AI_BUFFER_FMT_GET_FBITS(buffer->format),
                (int)AI_BUFFER_FMT_GET_BITS(buffer->format),
                AI_BUFFER_FMT_GET_SIGN(buffer->format)?"signed":"unsigned");
    else if (type_id == AI_BUFFER_FMT_TYPE_FLOAT)
        printf("FLOAT (%dbits, %s)",
                (int)AI_BUFFER_FMT_GET_BITS(buffer->format),
                AI_BUFFER_FMT_GET_SIGN(buffer->format)?"signed":"unsigned");
    else
        printf("NONE");
    printf(" size=%ldbytes\r\n", AI_BUFFER_BYTE_SIZE(AI_BUFFER_SIZE(buffer),
            buffer->format));
}

__STATIC_INLINE void aiPrintNetworkInfo(const ai_network_report* report)
{
    int i;
    printf("Network configuration...\r\n");
    printf(" Model name         : %s\r\n", report->model_name);
    printf(" Model signature    : %s\r\n", report->model_signature);
    printf(" Model datetime     : %s\r\n", report->model_datetime);
    printf(" Compile datetime   : %s\r\n", report->compile_datetime);
    printf(" Runtime revision   : %s (%d.%d.%d)\r\n", report->runtime_revision,
            report->runtime_version.major,
            report->runtime_version.minor,
            report->runtime_version.micro);
    printf(" Tool revision      : %s (%d.%d.%d)\r\n", report->tool_revision,
            report->tool_version.major,
            report->tool_version.minor,
            report->tool_version.micro);
    printf("Network info...\r\n");
    // printf("  signature         : 0x%lx\r\n", report->signature);
    printf("  nodes             : %ld\r\n", report->n_nodes);
    printf("  complexity        : %ld MACC\r\n", report->n_macc);
    printf("  activation        : %ld bytes\r\n",
            AI_BUFFER_SIZE(&report->activations));
    printf("  params            : %ld bytes\r\n",
            AI_BUFFER_SIZE(&report->params));
    printf("  inputs/outputs    : %u/%u\r\n", report->n_inputs,
            report->n_outputs);
    for (i=0; i<report->n_inputs; i++)
        aiPrintLayoutBuffer("   IN ", i, &report->inputs[i]);
    for (i=0; i<report->n_outputs; i++)
        aiPrintLayoutBuffer("   OUT", i, &report->outputs[i]);
}

static int aiBootstrap(const char *nn_name, const int idx)
{
    ai_error err;

    /* Creating the network */
    printf("Creating the network \"%s\"..\r\n", nn_name);
    err = ai_mnetwork_create(nn_name, &net_ctx[idx].handle, NULL);
    if (err.type) {
        aiLogErr(err, "ai_mnetwork_create");
        return -1;
    }

    /* Query the created network to get relevant info from it */
    if (ai_mnetwork_get_info(net_ctx[idx].handle, &net_ctx[idx].report)) {
        aiPrintNetworkInfo(&net_ctx[idx].report);
    } else {
        err = ai_mnetwork_get_error(net_ctx[idx].handle);
        aiLogErr(err, "ai_mnetwork_get_info");
        ai_mnetwork_destroy(net_ctx[idx].handle);
        net_ctx[idx].handle = AI_HANDLE_NULL;
        return -2;
    }

    /* Initialize the instance */
    printf("Initializing the network\r\n");
    /* build params structure to provide the reference of the
     * activation and weight buffers */
    const ai_network_params params = {
            AI_BUFFER_NULL(NULL),
            AI_BUFFER_NULL(activations) };

    if (!ai_mnetwork_init(net_ctx[idx].handle, &params)) {
        err = ai_mnetwork_get_error(net_ctx[idx].handle);
        aiLogErr(err, "ai_mnetwork_init");
        ai_mnetwork_destroy(net_ctx[idx].handle);
        net_ctx[idx].handle = AI_HANDLE_NULL;
        return -4;
    }
    return 0;
}

static int aiInit(void)
{
    const char *nn_name;
    int idx;

    printf("\r\nAI Network (AI platform API %d.%d.%d)...\r\n",
            AI_PLATFORM_API_MAJOR,
            AI_PLATFORM_API_MINOR,
            AI_PLATFORM_API_MICRO);

    /* Discover and init the embedded network */
    idx = 0;
    do {
    	nn_name = ai_mnetwork_find(NULL, idx);
    	if (nn_name) {
    		printf("\r\nFound network \"%s\"\r\n", nn_name);
    		if (aiBootstrap(nn_name, idx))
    		    return -1;
    	}
    	idx++;
    } while (nn_name);

    return 0;
}

static void aiDeInit(void)
{
    ai_error err;
    int idx;

    printf("Releasing the network(s)...\r\n");

    for (idx=0; idx<AI_MNETWORK_NUMBER; idx++) {
        if (net_ctx[idx].handle) {
            if (ai_mnetwork_destroy(net_ctx[idx].handle) != AI_HANDLE_NULL) {
                err = ai_mnetwork_get_error(net_ctx[idx].handle);
                aiLogErr(err, "ai_mnetwork_destroy");
            }
            net_ctx[idx].handle = NULL;
        }
    }
}

/* -----------------------------------------------------------------------------
 * Specific APP/test functions
 * -----------------------------------------------------------------------------
 */

#if defined(__GNUC__)
extern uint32_t _estack[];
#elif defined (__ICCARM__)
extern int CSTACK$$Limit;
extern int CSTACK$$Base;
#elif defined (__CC_ARM)
#if _APP_STACK_MONITOR_ == 1
#error STACK monitoring is not yet supported
#endif
#else
#error ARM MCU tool-chain is not supported.
#endif

static bool profiling_mode = false;
static int  profiling_factor = 5;

#if defined(__GNUC__)
// #pragma GCC push_options
// #pragma GCC optimize ("O0")
#elif defined (__ICCARM__)
// #pragma optimize=none
#endif


static int aiTestPerformance(int idx)
{
    int iter;
    uint32_t irqs;
    ai_i32 batch;
    int niter;

