yohanes-erwin/deeplearningedge/nn_nand_gate/stm32f446_hal_nand_performance/Middlewares/ST/Application/SystemPerformance/Src/aiSystemPerformance.c
    struct dwtTime t;
    uint64_t tcumul;
    uint32_t tstart, tend;
    uint32_t tmin;
    uint32_t tmax;
    uint32_t cmacc;

    ai_buffer ai_input[1];
    ai_buffer ai_output[1];

#if _APP_STACK_MONITOR_ == 1
    uint32_t ctrl;
    bool stack_mon;
    uint32_t susage;

    uint32_t ustack_size; /* used stack before test */
    uint32_t estack;      /* end of stack @ */
    uint32_t mstack_size; /* minimal master stack size */
    uint32_t cstack;      /* current stack @ */
    uint32_t bstack;      /* base stack @ */
#endif

    if (net_ctx[idx].handle == AI_HANDLE_NULL) {
        printf("E: network handle is NULL\r\n");
        return -1;
    }

#if _APP_STACK_MONITOR_ == 1
    /* Reading ARM Core registers */
    ctrl = __get_CONTROL();
    cstack = __get_MSP();

#if defined(__GNUC__)
    estack = (uint32_t)_estack;
    bstack = estack - MIN_STACK_SIZE;
    mstack_size = MIN_STACK_SIZE;
#elif defined (__ICCARM__)
    estack = (uint32_t)&CSTACK$$Limit;
    bstack = (uint32_t)&CSTACK$$Base;
    mstack_size = (uint32_t)&CSTACK$$Limit - (uint32_t)&CSTACK$$Base;
#endif

#endif

    if (profiling_mode)
        niter = _APP_ITER_ * profiling_factor;
    else
        niter = _APP_ITER_;

    printf("\r\nRunning PerfTest on \"%s\" with random inputs (%d iterations)...\r\n",
            net_ctx[idx].report.model_name, niter);

 #if _APP_STACK_MONITOR_ == 1
   /* Check that MSP is the active stack */
    if (ctrl & CONTROL_SPSEL_Msk) {
        printf("E: MSP is not the active stack (stack monitoring is disabled)\r\n");
        stack_mon = false;
    } else
      stack_mon = true;

    /* Calculating used stack before test */
    ustack_size = estack - cstack;

    if ((stack_mon) && (ustack_size > mstack_size)) {
        printf("E: !stack overflow detected %ld > %ld\r\n", ustack_size,
                mstack_size);
        stack_mon = false;
    }
#endif

#if _APP_DEBUG_ == 1
    printf("D: stack before test (0x%08lx-0x%08lx %ld/%ld ctrl=0x%08lx\n",
            estack, cstack, ustack_size, mstack_size, ctrl);
#endif

    irqs = disableInts();

#if _APP_STACK_MONITOR_ == 1
    /* Fill the remaining part of the stack */
    if (stack_mon) {
      uint32_t *pw =  (uint32_t*)((bstack + 3) & (~3));

#if _APP_DEBUG_ == 1
      printf("D: fill stack 0x%08lx -> 0x%08lx (%ld)\n", pw, cstack,
             cstack - (uint32_t)pw);
#endif
      while ((uint32_t)pw < cstack) {
        *pw = 0xDEDEDEDE;
        pw++;
      }
    }
#endif

    /* reset/init cpu clock counters */
    tcumul = 0ULL;
    tmin = UINT32_MAX;
    tmax = 0UL;

    memset(&ia_malloc,0,sizeof(struct ia_malloc));

    if ((net_ctx[idx].report.n_inputs != 1) ||
        (net_ctx[idx].report.n_outputs != 1))
    {
        printf("E: multiple I/O network support not yet supported...\r\n");
        HAL_Delay(100);
        return -1;
    }

    ai_input[0] = net_ctx[idx].report.inputs[0];
    ai_output[0] = net_ctx[idx].report.outputs[0];

    ai_input[0].n_batches  = 1;
    ai_input[0].data = AI_HANDLE_PTR(in_data);
    ai_output[0].n_batches = 1;
    ai_output[0].data = AI_HANDLE_PTR(out_data);

    if (profiling_mode) {
        printf("Profiling mode (%d)...\r\n", profiling_factor);
        fflush(stdout);
    }

    for (iter = 0; iter < niter; iter++) {
      /* Fill input vector */
        const ai_buffer_format fmt = AI_BUFFER_FORMAT(&ai_input[0]);
        for (ai_size i = 0; i < AI_BUFFER_SIZE(&ai_input[0]); ++i) {
            /* uniform distribution between -1.0 and 1.0 */
            const float v = 2.0f * (ai_float) rand() / (ai_float) RAND_MAX - 1.0f;
            if  (AI_BUFFER_FMT_GET_TYPE(fmt) == AI_BUFFER_FMT_TYPE_FLOAT) {
              *(ai_float *)(in_data + i * 4) = v;
            }
            else {
              in_data[i] = (ai_i8)(v * 127);
            }
        }

#if _APP_HEAP_MONITOR_ == 1
        ia_malloc.cfg |= 1UL;
#endif
        dwtReset();
        tstart = dwtGetCycles();

        batch = ai_mnetwork_run(net_ctx[idx].handle, &ai_input[0], &ai_output[0]);
        if (batch != 1) {
            aiLogErr(ai_mnetwork_get_error(net_ctx[idx].handle),
                    "ai_mnetwork_run");
            break;
        }

        tend = dwtGetCycles() - tstart;

#if _APP_HEAP_MONITOR_ == 1
        ia_malloc.cfg &= ~1UL;
#endif

        if (tend < tmin)
            tmin = tend;

        if (tend > tmax)
            tmax = tend;

        tcumul += (uint64_t)tend;

#if _APP_DEBUG_ == 1
        dwtCyclesToTime(tend, &t);
        printf(" #%02d %8d.%03dms (%lu cycles)\r\n", iter,
                t.ms, t.us, tend);
#else
        if (!profiling_mode) {
            printf(".");
            fflush(stdout);
        }
#endif
    }

#if _APP_DEBUG_ != 1
    printf("\r\n");
#endif

#if _APP_STACK_MONITOR_ == 1
    if (__get_MSP() != cstack) {
       printf("E: !current stack address is not coherent 0x%08lx instead 0x%08lx\r\n",
              __get_MSP(), cstack);
    }
#endif

#if _APP_STACK_MONITOR_ == 1
   /* Calculating the used stack */
   susage = 0UL;
   if (stack_mon) {
        uint32_t rstack = mstack_size - ustack_size;
        uint32_t *pr =  (uint32_t*)((bstack + 3) & (~3));
        bool overflow = false;

        /* check potential stack overflow with 8 last words*/
        for (int i = 0; i < 8; i++) {
          if (*pr != 0xDEDEDEDE)
            overflow = true;
          pr++;
        }

        if (!overflow) {
          susage = 8*4;
          while ((*pr == 0xDEDEDEDE) && ((uint32_t)pr < cstack)) {
            pr++;
            susage += 4;
          }
          susage = rstack - susage;
        } else {
            printf("E: !stack overflow detected > %ld\r\n", rstack);
        }
    }
#endif

    restoreInts(irqs);

    printf("\r\n");

    tcumul /= (uint64_t)iter;

    dwtCyclesToTime(tcumul, &t);

    printf("Results for \"%s\", %d inferences @%ldMHz/%ldMHz (complexity: %lu MACC)\r\n",
            net_ctx[idx].report.model_name, iter,
            HAL_RCC_GetSysClockFreq() / 1000000,
            HAL_RCC_GetHCLKFreq() / 1000000,
            net_ctx[idx].report.n_macc);

    printf(" duration     : %d.%03d ms (average)\r\n", t.s * 1000 + t.ms, t.us);
    printf(" CPU cycles   : %lu -%lu/+%lu (average,-/+)\r\n",
            (uint32_t)(tcumul), (uint32_t)(tcumul - tmin),
            (uint32_t)(tmax - tcumul));
    printf(" CPU Workload : %d%c\r\n", (int)((tcumul * 100) / t.fcpu), '%');
    cmacc = (uint32_t)((tcumul * 100)/ net_ctx[idx].report.n_macc);
    printf(" cycles/MACC  : %lu.%02lu (average for all layers)\r\n",
            cmacc / 100, cmacc - ((cmacc / 100) * 100));
#if _APP_STACK_MONITOR_ == 1
    if (stack_mon)
      printf(" used stack   : %ld bytes\r\n", susage);
    else
      printf(" used stack   : NOT CALCULATED\r\n");
#else
    printf(" used stack   : DISABLED\r\n");
#endif
#if _APP_HEAP_MONITOR_ == 1
    printf(" used heap    : %ld:%ld %ld:%ld (req:allocated,req:released) cfg=%ld\r\n",
            ia_malloc.alloc_req, ia_malloc.alloc,
            ia_malloc.free_req, ia_malloc.free,
            (ia_malloc.cfg & (3 << 1)) >> 1);
#else
    printf(" used heap    : DISABLED or NOT YET SUPPORTED\r\n");
#endif

