yohanes-erwin/deeplearningedge/nn_nand_gate/stm32f446_hal_nand_performance/Middlewares/ST/Application/SystemPerformance/Src/aiSystemPerformance.c
    return 0;
}

#if defined(__GNUC__)
// #pragma GCC pop_options
#endif

#define CONS_EVT_TIMEOUT    (0)
#define CONS_EVT_QUIT       (1)
#define CONS_EVT_RESTART    (2)
#define CONS_EVT_HELP       (3)
#define CONS_EVT_PAUSE      (4)
#define CONS_EVT_PROF       (5)

#define CONS_EVT_UNDEFINED  (100)

static int aiTestConsole(void)
{
    uint8_t c = 0;

    if (ioGetUint8(&c, 1, 5000) == -1) /* Timeout */
        return CONS_EVT_TIMEOUT;

    if ((c == 'q') || (c == 'Q'))
        return CONS_EVT_QUIT;

    if ((c == 'r') || (c == 'R'))
        return CONS_EVT_RESTART;

    if ((c == 'h') || (c == 'H') || (c == '?'))
        return CONS_EVT_HELP;

    if ((c == 'p') || (c == 'P'))
        return CONS_EVT_PAUSE;

    if ((c == 'x') || (c == 'X'))
        return CONS_EVT_PROF;

    return CONS_EVT_UNDEFINED;
}


/* -----------------------------------------------------------------------------
 * Exported/Public functions
 * -----------------------------------------------------------------------------
 */

int aiSystemPerformanceInit(void)
{
    printf("\r\n#\r\n");
    printf("# %s %d.%d\r\n", _APP_NAME_ , _APP_VERSION_MAJOR_,
            _APP_VERSION_MINOR_ );
    printf("#\r\n");

#if defined(__GNUC__)
    printf("Compiled with GCC %d.%d.%d\r\n", __GNUC__, __GNUC_MINOR__,
            __GNUC_PATCHLEVEL__);
#elif defined(__ICCARM__)
    printf("Compiled with IAR %d (build %d)\r\n", __IAR_SYSTEMS_ICC__,
            __BUILD_NUMBER__
    );
#elif defined (__CC_ARM)
    printf("Compiled with MDK-ARM Keil %d\r\n", __ARMCC_VERSION);
#endif

    dwtIpInit();
    crcIpInit();
    logDeviceConf();

    aiInit();

    srand(3); /* deterministic outcome */

    dwtReset();
    return 0;
}

int aiSystemPerformanceProcess(void)
{
    int r;
    int idx = 0;

    do {
        r = aiTestPerformance(idx);
        idx = (idx+1) % AI_MNETWORK_NUMBER;

        if (!r) {
            r = aiTestConsole();

            if (r == CONS_EVT_UNDEFINED) {
                r = 0;
            } else if (r == CONS_EVT_HELP) {
                printf("\r\n");
                printf("Possible key for the interactive console:\r\n");
                printf("  [q,Q]      quit the application\r\n");
                printf("  [r,R]      re-start (NN de-init and re-init)\r\n");
                printf("  [p,P]      pause\r\n");
                printf("  [h,H,?]    this information\r\n");
                printf("   xx        continue immediately\r\n");
                printf("\r\n");
                printf("Press any key to continue..\r\n");

                while ((r = aiTestConsole()) == CONS_EVT_TIMEOUT) {
                    HAL_Delay(1000);
                }
                if (r == CONS_EVT_UNDEFINED)
                    r = 0;
            }
            if (r == CONS_EVT_PROF) {
                profiling_mode = true;
                profiling_factor *= 2;
                r = 0;
            }

            if (r == CONS_EVT_RESTART) {
                profiling_mode = false;
                profiling_factor = 5;
                printf("\r\n");
                aiDeInit();
                aiSystemPerformanceInit();
                r = 0;
            }
            if (r == CONS_EVT_QUIT) {
                profiling_mode = false;
                printf("\r\n");
                disableInts();
                aiDeInit();
                printf("\r\n");
                printf("Board should be reseted...\r\n");
                while (1) {
                    HAL_Delay(1000);
                }
            }
            if (r == CONS_EVT_PAUSE) {
                printf("\r\n");
                printf("Press any key to continue..\r\n");
                while ((r = aiTestConsole()) == CONS_EVT_TIMEOUT) {
                    HAL_Delay(1000);
                }
                r = 0;
            }
        }
    } while (r==0);

    return r;
}

void aiSystemPerformanceDeInit(void)
{
    printf("\r\n");
    aiDeInit();
    printf("bye bye ...\r\n");
}

